// cуворий режим
"use strict";

let r = new Date();
console.log(r);

const d1 = new Date();

console.log(d1.getFullYear()); //2025

console.log(d1.getMonth()); //6

console.log(d1.getMilliseconds()); //916

console.log(d1.getTime()); //1751808752774

console.log(d1.setDate(5000)); //2183294454540

console.log(d1); //Wed Mar 09 2039 15:40:41 GMT+0100 (за центральноєвропейським стандартним часом)

//-----

const d2 = new Date();

d2.setDate(d2.getDate() + 56);
console.log(d2); //Sun Aug 31 2025 15:43:18 GMT+0200 (за центральноєвропейським літнім часом)
//-------------

// Задача №1. Визначити привітання у залежності від часу доби(Доброго дня(до 16), Доброго ранку(до 11), Доброго вечора)

// function getGreeting() {
//   const currentDate = new Date();

//   const currentHours = currentDate.getHours();

//   let res;

//   if (currentHours < 11) res = "Доброго ранку";
//   else if (currentHours <= 16) res = "Доброго дня";
//   else res = "Доброго вечора";

//   return res;
// }

// document.writeln(getGreeting());

//---------

// Задача №2. Вивести дату у форматі:(місяць-рік-вихідний/робочий)

// function isWorkingDay(date) {
//   const day = date.getDay(); // 0-це неділя
//   return day > 0 && day < 6;
// }
// function getFormattedDate(date) {
//   const dayLabel = isWorkingDay(date) ? "робочий" : "вихідний";
//   const month = date.getMonth();
//   const year = date.getFullYear();

//   return `${month+1} - ${year} = ${dayLabel}`;
// }

// document.writeln(getFormattedDate(new Date()));

//-----------------

// Задача №3. Користуач іде у відпустку на 56 днів. Визначити дату на момент його повернення

// function getReturnDate(holidayDaysNumber) {
//   const currentDate = new Date()
//   currentDate.setDate(currentDate.getDate() + holidayDaysNumber); // setDate()-дні

//   return currentDate
// }

// document.writeln(getReturnDate(56).toLocaleDateString('uk-UA'))

//------------------

// Задача №4. Задаємо користувачу задачу з додавання двох чисел. Визначити скільки секунд було використано для розв'язання задачі.

// function getSecondsForAnswer() {
// 	const start = new Date()
// 	const res = parseInt(prompt('1212+333545=?'))
// 	const end = new Date()
// 	const seconds = (end-start)/1000 // оскільки в мілісекундах, ділимо на 1000
// 	document.writeln(`Ви витратили на обчислення ${seconds}`)
// 	return res
// }

// getSecondsForAnswer()

//---------- ЗБЕРІГАННЯ ДАНИХ У БРАУЗЕРІ (на стороні клієнта) --------------------

// Задача №1. Зберігати ім'я користувача при заході на сайт та кількість відвідувань (localStorage)

// function visitsCounter() {
//   let userName = localStorage.getItem("userName");
//   let visitsNumber;

//   if (userName) {
//     visitsNumber = parseInt(localStorage.getItem("visitsNumber"));
//     visitsNumber++;
//     localStorage.setItem("visitsNumber", visitsNumber);
//   } else {
//     userName = prompt("Name: ");
//     visitsNumber = 1;
// 	 localStorage.setItem('userName', userName)
// 	 localStorage.setItem('visitsNumber', visitsNumber)
//   }
//   document.writeln(`${userName} - ${visitsNumber}`)
// }

// visitsCounter()

//---------------------------------------

//* 1:16 - window.addEventListener('storage', onChangeStorage) зміна мови/валюти на всіх вкладках

//---------------------------------------

//*-------------- РЯДКИ. РЕГУЛЯРНІ ВИРАЗИ --------------

// Задача №1.
// let h = 3;
// let m = 5;
// let time = `${h.toString().padStart(2, "0")}:${m.toString().padStart(2, "0")}`; // при використанні padStart() обов'язково спочатку потрібно пертворити в рядочок toString()
// document.writeln(time)

//---------------------------------------

// Задача №2. Дано адресу сайту. Перевірити, чи є він з шифруванням(починається з "https")
// let url = "Https://test.test";
// if (url.toLocaleLowerCase().startsWith("https")) alert("ok");
// else alert("Danger");

//---------------------------------------

// Задача №3. Дано номер телефоную Перевірити, чи є цей телефон телефоном з України (починається на "+38")

// const phone = "+380506667788";
// document.writeln(phone.startsWith("+38") ? "ua" : "Other");

//---------------------------------------

//* ===================== РЕГУЛЯРНІ ВИРАЗИ (RegExp)======================================
// Дозволяють описувати шаблони фрагментів тексту
// /шаблон/ модифікатори
//*2:03
// Приклад

// const s = "Я купив 12 кг.цукерок, а мій сусід - 23. А моя сестра 211";
// console.log(s.match(/\d/g)); // (7) ['1', '2', '2', '3', '2', '1', '1']
// console.log(s.match(/\d+/g)); // (3) ['12', '23', '211']

//------------ test, search, match -----------------
// Дано номер телефоную Перевірити, чи є цей телефон телефоном з України (починається на "+38")

// const phone = "+380506667788";
// document.writeln(/\+38/.test(phone) ? "ua" : "Other");

// const phone = "333333+380506667788";
// document.writeln(/\+38/.test(phone) ? "ua" : "Other"); //* в цьому випадку знайде всеодно(хоч +38 знаходиться всередині)  і це буде неправильно

// const phone = "333333+380506667788";
// document.writeln(/^\+38/.test(phone) ? "ua" : "Other"); 
//------------------- квантифікатори -----------------------------
// let text = 'Номер мого авто АО1234ВВ. Мені 21 рік.'
// повинен містити один з вказаних символів(вказуємо в квадратних дужках): /[аоуиіе]/.test(text) //true
//--
// хоча один не з вказаних символів /[^список символів]/
//---
// символи з діапазону [start-end]
//---
// не лише символи з діапазону [^ start-end]
//---
//альтернативні варіанти : /(red|green)/  // через або
// .(крапка)-це будь-який символ
//---
// \d  - довільна цифра(0-9)
// text.match(/\d/g)
//---
// \D -- не цифра
// \w - буква(латинського алфавіту), цифра, символ нижнього підкреслювання(A-Z,a-z,0-9)
// \W - не буква, не цифра, не символ нижнього підкреслювання
// + -- принаймні одне входження(попереднього символу) кіл-ть >=1
// "*" -- довільна кількість або відсутність(попереднього символу) >=0 (зірочка відноситься до символу, після якого поставлена) /lo*/g -- або l або lo
// "?" -- входить один раз або відсутність 0<= кількість <=1
// рівно n символів(кількість n) {n}
// не менше n символів (кількість >=0) {n,}
//від n до m n<=кількість<=m {n,m}

//------------ Позиція фрагмента пошуку(початок, кінець) -----------------
// початок рядка "^" (якщо в квадратних дужках[^_ _ _]-шукаємо все, крім цих символів)
//кінець рядка"$"
//початок або кінець слова "\b"
//не початок або кінець слова "\B"

//===========================================================================

// const s ='vlfdvlkjkvj65656 5454kg'
// console.log(s.match(/\d{4}/g)) // (2) ['6565', '5454']
// console.log(s.match(/\d{5}/g)) // ['65656']

// const s2 = "vlfdvlkjkvj23 3323kg 45";
// console.log(s2.match(/\d{2}/g)) // \d{2} - 2 цифри (4) ['23', '33', '23', '45']
// console.log(s2.match(/\b\d{2}/g))  //початок або кінець слова "\b"("відсіялись") (2) ['33', '45']
// console.log(s2.match(/\b\d{2}\b/g))  //початок або кінець слова "\b"("відсіялись")['45']

// console.log(s2.match(/\b\d+/g))  //(2) ['3323', '45'] "+" -- кіл-ть цифр  >=1

// const s3 = "2323 vlfdvlkjkvj23 3323kg 45";
// console.log(s3.match(/\b\d+/g))  // (3) ['2323', '3323', '45'] "+" -- кіл-ть цифр  >=1
// console.log(s3.match(/\B\d+/g))  // не початок або кінець слова "\B" (4) ['323', '23', '323', '5']
// console.log(s3.match(/\b\d+$/g))  // довільна кількість цифр, знаходиться в кінці($) ['45']

//===========================================================================
// Задача. Визначити чи може бути рядок тексту номером банківської картки(приклад:"4142-3433-2323-3434")
// const a = 'myCard:1234-1234-1234-1234 ndvjkdsnj'
// console.log(a.match(/\b\d{4}-\d{4}-\d{4}-\d{4}\b/g)); //['1234-1234-1234-1234']
//----
//Задача. Дано адресу сайту. Визначити, чи є він урядовим(містить домен "gov")

// /^https?:\/\//
//*2:44
//---
//Задача. Вибрати усі роки після 2021 року з отриманого повідомлення(чотири цифри)
// /202[2-9]/
// /20[3-9]\d/-якщо роки від 2030, а потім будь-яка цифра(\d)
// let myText = 'aaaa 2000 bbbbb 2024 ccccc 2030 vvv 2029 fff'
// let res = myText.match(/20[3-9]\d|202[2-9]/g)
// console.log(res)  //(3) [' 2024', '2030 ', ' 2029']

//===========================================================================

//* Робота з групами (дозволяють групувати окремі фрагменти рядка)
//*2:50

// let str = 'He said:"She\'s the one!".';
// let reg = /(['"])(.*?)\1/g; // всередині регулярного виразу посилаємось на групи / ..../g
// // []-це один із символяв регулярного виразу:або лапка одинарна, або подвійна
// // (['"]) - круглі дужки означають, що це група(нумерується від 1)
// // "." - довільний символ 
// // "*" - символів може бути довільна кількість >=0
// // "\1" - фрагмент, який відповідає групі під номером 1
// console.log(str.match(reg)) //[`"She's the one!"`]

//=========================================================================
//* Робота з групами (позиція фрагменту у залежності від розташування інших фрагментів)
//*3:05

