// cуворий режим
"use strict"

// ==========================================================

//Дано рік народження (дата: 1 січня) та поточний рік. Знайти кількість років.

// Крок 0. Позначення
// рік народження - yearOfBirth
// поточний рік - currentYear
// кількість років - numberOfYears

// Крок 1. Вводимо необхідні дані
const yearOfBirth = parseInt(prompt('Введіть свій рік народження', 'Ваш рік народження'));
const currentYear = 2025;

// Крок 2. Обчислення результату
const numberOfYears = currentYear - yearOfBirth;

// Крок 3. Виведення результатів
document.write(
  `<div class="task__subtitle task__subtitle--green">Ви ${yearOfBirth} року народження, Вам в цьому році виповнилось, або виповниться ${numberOfYears} років</div>`
);


// =================================================================