// cуворий режим
"use strict";

document.addEventListener("click", function (e) {
  const targetElement = e.target;
  if (targetElement.closest(".header__icon")) {
    document.documentElement.classList.toggle("menu-open");
  }
});

// ===================================================================

// 15 разів вивести слово "Hello"
// for (let num = 1; num <= 3; num++) {
// 	document.write(`Hello <br>`)
// }

// ===================================================================

// 10 разів вивести заголовок "Мир"
// for (let i = 0; i <10; i++) { // якщо номеер неважливий-нумерація починається з "0", щоб не ставити зайвий символ"="
// 	document.write(`<h1>Мир</h1>`);
// }

// ===================================================================

// З клавіатури вводиться 5 пар цілих чисел. Якщо числа рівні, то вивести їх суму, інакше - добуток

// for (let i = 0; i < 5; i++) {
// 	let num1=parseInt(prompt("Num1="))
// 	let num2 = parseInt(prompt("Num2="));
// 	if(num1===num2) {
// 		document.write(`Sum=${num1+num2}`)
// 	} else {
// 		let product=num1*num2
// 		document.write(`Prod=${product}`);
// 	}
// }

// =======================================================

// З клавіатури 6 разів генерується ціле число в межах від 1 до 10 і кожного разу дається можливість користувачу вгадати число.

// let guessedCount=0 // const не підходить, бо число буде змінюватись. Вводимо ПЕРЕД циклом, інакше кожен раз буде починатись з 0

// for (let i = 0;  i< 6; i++) {
// let compNum = 1+Math.floor(Math.random()*10)
// 	let userNum = parseInt(prompt("Введіть число(від 1 до 10)"))
// 	if (userNum===compNum) {
// 		guessedCount++
// 	}
// 	document.write(`User:${userNum}, Comp:${compNum}<br>`)
// }
// document.write(`Вгадано:${guessedCount}`);// є помилкою вставляти виведення результату в сам цикл

// У циклі має бути тільки те, що потрібно повторювати!!! А те, що потрібно вивидити один раз-після циклу

// =============================================================

// Поступово вводяться вартості 7 товарів. Знайти загальну вартість.

// let totalPrice = 0
// for (let i = 0; i < 7; i++) {
// 	const productPrice = parseFloat(prompt('Введіть вартість товару'))
// totalPrice = totalPrice + productPrice
// 	totalPrice += productPrice;
// }
// document.write(`totalPrice:${totalPrice}`);

// ===============================================================

// Поступово вводяться вартості 7 товарів із зазначенням номеру товару. Знайти загальну вартість.

// let totalPrice = 0;
// for (let i = 0; i < 7; i++) {
//   const productPrice = parseFloat(prompt(`Введіть вартість № ${i+1} товару`));
// totalPrice = totalPrice + productPrice
//   totalPrice += productPrice;
// }
// document.write(`totalPrice:${totalPrice}`);
// альтернативний варіант написання для спрощення та читабельності коду
// const productsNumber = 7
// let totalPrice = 0;
// for (let i = 1; i <= productsNumber; i++) {
//   const productPrice = parseFloat(prompt(`Введіть вартість № ${i} товару`));
// totalPrice = totalPrice + productPrice
//   totalPrice += productPrice;
// }
// document.write(`totalPrice:${totalPrice}`);

// ===================================================

// Вивести на екран усі числа від 6 до 28 кратні 3
// for (let i = 6; i <= 28; i+=3) {
// document.write(`<p>${i}</p>`);
// }
// ====================================================

// Вивести на екран усі парні числа від 12 до 34
// for (let i = 12; i <= 34; i+=2) {
// document.write(`<p>${i}</p>`);
// }

// =====================================================

// Вивести десятки від 10 до 100
// for (let d = 10; d <=100; d+=10) {
// document.write(`<p>${d}</p>`);
// }

// =====================================================

// Вивести десятки від 100 до 10(у зворотньому порядку)
// for (let d = 100; d >=10; d-=10) {
// document.write(`<p>${d}</p>`);
// }

// =====================================================

// Вивести номери місяців другого півріччя(номери місяців від 7 до 12)
// for (let month = 7; month <= 12; month++) {
// 	document.write(`<p>Місяць${month}</p>`);
// }

// =====================================================

// Вивести суми сплаченого кредиту. Початковий внесок 5000грн, кінцевий 15000грн, а щомісячний внесок 2000грн
// for (let creditValue = 5000; creditValue <= 15000; creditValue+=2000) {
// 	document.write(`<p>Сума сплаченого кредиту:${creditValue}</p>`);
// }

// =====================================================

//"Тренажер додавання". Розробити програму для перевірки знань з додавання цілих чисел в межах від 1 до 3(перебрати усі можливі комбінації додавання цілих чисел(тобто перше число перебрати від 1 до 3 і для кожного першого числа від 1 до 3)). Іншими словами:
// 1+1, 1+2, 1+3
// 2+1, 2+2, 2+3
// 3+1, 3+2, 3+3

// for (let num1 = 1; num1 <=3; num1++) {
//   for (let num2 = 1; num2 <=3; num2++)
// 	{
//     let userAns = parseInt(prompt(`${num1}+${num2}=`));
//     if (userAns === num1 + num2) {
//       alert("ok");
//     } else {
//       alert("Error");
//     }
//   }
// }

// =======================================================

// "Тренажер множення". розробити програму, яка випадковим чином(4 рази) генерує перше число в межах від 1 до 9, друге число від 1 до 9 і перевірити чи знає користувач, чому дорівнює результат їх множення. підрахувати кількість правильних відповідей.
// let correctAnswersNumber = 0; // кількість правильних відповідей
// for (let i = 1; i <= 4; i++) {
//   const num1 = 1 + Math.floor(Math.random() * (9 - 1 + 1));
//   const num2 = 1 + Math.floor(Math.random() * (9 - 1 + 1));
//   const userAnswer = parseInt(prompt(`Приклад ${i}.Чому дорівнює: ${num1}*${num2}?`) );
//   if (userAnswer === num1 * num2) { // якщо відповідь вірна,
//     correctAnswersNumber++;// то збільшуємо кількість правильних відповідей на 1
//     alert(`Ok`);
//   } else {
//     alert(`Помилка!!${num1}*${num2}=${num1 * num2}`);
//   }
// }
// ----- Виводимо результат ПІСЛЯ
// document.write(`Кількість правильних відповідей = ${correctAnswersNumber}`);

// ===========================================================

// Перевірити таблицю множення від 3 до 8 (друге число змінюється завжди від 1 до 9)
// let correctAnswersNumber = 0; // кількість правильних відповідей

// for (let num1 = 3; num1 <=8; num1++) {
// 	for (let num2 = 1; num2 <=9; num2++) {
// 		const userAnswer = parseInt(
//       prompt(`Чому дорівнює: ${num1}*${num2}?`)
//     )
// 	  if (userAnswer === num1 * num2) { // якщо відповідь вірна,
//    correctAnswersNumber++;// то збільшуємо кількість правильних відповідей на 1
//     alert(`Ok`);
//    } else {
//    alert(`Помилка!!${num1}*${num2}=${num1 * num2}`);
//    }
// 	}
// }
// document.write(`Кількість правильних відповідей = ${correctAnswersNumber}`);

// З клавіатури поступово вводяться імена 5 учнів. Визначити скільки є імен Іван
// let numberIvans = 0
// for (let i = 1; i <=5; i++) {
// 	const pupilName = prompt(`Введіть ім'я учня № ${i}`)
// 	if (pupilName==='Ivan') numberIvans++
// }
// document.write(`Кількість Іванів = ${numberIvans}`);

// ===============================================================

// Реалізувати за допомогою alert таймер відліку від 10 до 1
// for (let i = 10; i > 1; i--) {
//   alert(i);
// }

// ================================================================

// Вводимо початкову кількість булочок, які треба продати. Поки залишаються булочки продавати їх клієнтам
// let bunsNumber = parseInt(prompt(`Введіть кількість булочок`))
// while (bunsNumber>0) {
// 	const userBunsNumber = parseInt(prompt(`Вітаю! Скільки булочок хочете купити? В наявності є${bunsNumber}`))
// 	if(userBunsNumber<=bunsNumber){
// 		alert(`Візьміть. Смачного!`)
// 		bunsNumber-=userBunsNumber
// 	}
// 	else
// 	alert(`Вибачте, такої кількості немає`)
// }

// =======================================================

// З клавіатури вводяться два числа N і M (N < M). Вивести на екран числа
// N ---M
// N+1 --- M -1
// N+2 --- M -2
// N+3 --- M -3
// -----з використанням циклу while
//  let n =1, m=9
// while (n<m) {
// 	document.write(`${n}-${m}<br>`)
// 	n++
// 	m--
// }
// while (n < m) {
//   document.write(`${n++}-${m--}<br>`);
// }
// ------з використанням циклу for
// for (let n = 1, m = 9; n < m; n++, m--) {
//   document.write(`${n}-${m}<br>`);
// }

// ============================================
// ---- Нескінчений цикл
// for (;;) {
// alert(`Мир`);
// }
//
// ===========================================

// Оленка має 0 грн. і хоче назбирати на телефон (10000грн.). Для цього кожного разу допомагає мамі і отримує гонорар - випадкова величина від 1 до 200 грн. Підрахувати скільки разів треба допомагати Оленці Поки не назбирає на телефон.
// -----з використанням циклу do-while
// let totalMoney=0
// const phonePrice = 10000
// do {
//   const taskTitle = prompt(`Я маю ${totalMoney} грн.Люба мамо, чим допомогти?`);
//   const prize = 1 + Math.floor(Math.random() * 200);
//   totalMoney += prize;
// } while (totalMoney < phonePrice);
// alert(`Вітаю!`);
// Оленка має M грн.(вводиться з клавіатури) і хоче назбирати на телефон (10000грн.). Для цього кожного разу допомагає мамі і отримує гонорар - випадкова величина від 1 до 200 грн. Підрахувати скільки разів треба допомагати Оленці Поки не назбирає на телефон.
// -----з використанням циклу while
// const phonePrice = 10000;
// let totalMoney=parseFloat(prompt(`Скільки у тебе є грошей зараз?`))
//  while (totalMoney < phonePrice);{
//  const taskTitle = prompt(`Я маю ${totalMoney} грн.Люба мамо, чим допомогти?`);
//  const prize = 1 + Math.floor(Math.random() * 200);
//  totalMoney += prize;
//  }
//  alert(`Вітаю!`)

// =========================================================

// З клавіатури вводяться поступово двоцифрові числа. Знаходимо їх добуток поки не буде введено 0.
// -----з використанням циклу do-while
// let prod = 1
// let num
// do {
//    num = parseInt(prompt(`num=`));
//   if (num !== 0) prod *= num;
// } while (num !== 0);
// document.write(`prod=${prod}`)
// -----з використанням циклу while
// let prod = 1
// let num =1// щоб не писати зайвий раз num = parseInt(prompt(`num=`));
// while (num !== 0) {
// 	prod *= num;
// 	num = parseInt(prompt(`num=`));
// }

// ===========================================================

// З клавіатури вводяться числа до тих пір, поки не буде введено 3 парних.

// ============================================================

// З клавіатури вводиться пароль поки не буде вірним (правильний пароль "123").
// let password // вводимо ПЕРЕД циклом
// do {
// 	password = prompt(`Введіть пароль`)
// } while (password!=='123');

// ============================================================

// Поступово вводити 10 цілих чисел і знайти їх суму. Якщо буде ввеедено некоректне число, то припинити знаходження суми
// let sum = 0
// for (let i = 0; i < 10; i++) {
// 	let num = parseInt(prompt(`Number =`))
// 	if (!isFinite(num)) // якщо значення некоректне- припинити
// 	break
// 	sum += num
// }
// document.write(`Sum = ${sum}`);

// ============================================================

// 3 рази дати можливість ввести пароль(правильний пароль "123").
// const correctPassword = "123";
// let isLoggedIn = false;
// for (let i = 0; i < 3; i++) {
//   const password = prompt(`Введіть пароль`);
//   if (password === correctPassword) {
//     isLoggedIn = true;
//     break;
//   }
// }
// if (isLoggedIn === true) alert(`Вітаємо! Доступ дозволено`);
// else alert(`Доступ заборонено`);

// ===========================================================
// --- break з міткою  exit:, для переривання зовнішнього циклу(міткою може бути будь-яка назва)

// Користувач кожного дня протягом 3 тижнів купляв товар за ціною, що могла змінюватись щодня. Знайти скільки всього заплатив користувач. Якщо користувач припиняє введення(натиснув на "Відміна" під час введення), то вивести поточну суму і припинити сумування.
// let sum=0
// exit:for (let i = 0; i < 3; i++) {
// 	for (let j = 0; j < 7; j++) {
// 		let price = prompt(`Тиждень[${i}] день[${j}]=`);
// 		console.log(price)
// 		if(price===null)break exit
// 		sum+=parseFloat(price)
// 	}
// }
// document.write(`Sum = ${sum}`);

// ================================================================

// Поступово вітаємо 20 користувачів поки не прийде Іван
// for (let i = 0; i < 20; i++) {
// 	const userName = prompt(`Як вас звати?`)
// 	if (userName ==='Ivan')break
// 	alert (`Вітаю!${userName}`)
// }

// =================================================================

// Поступово вітаємо учнів з 3-х класів (по 20 учнів у класі) поки не зустрінемо Івана. Якщо зустріли Івана, то переходимо до наступного класу
// for (let classNum = 1; classNum <=3; classNum++) {
// 	for (let i = 0; i < 20; i++) {
// 		const userName = prompt(`Номер класу ${classNum}. Як вас звати?`)
// 		if(userName === 'Ivan') break
// 		alert(`Вітаю ${userName}`)
// 	}
// }

// Поступово вітаємо учнів з 3-х класів (по 20 учнів у класі) поки не зустрінемо Івана. Якщо зустріли Івана, то припиняємо повністю привітання і йдемо геть зі школи.
// classNumLoop: for (let classNum = 1; classNum <= 3; classNum++) {
//   for (let i = 0; i < 20; i++) {
//     const userName = prompt(`Номер класу ${classNum}. Як вас звати?`);
//     if (userName === "Ivan") break classNumLoop
//     alert(`Вітаю ${userName}`);
//   }
// }

// =================================================================

// Поступово вводити 10 цілих чисел і знайти їх суму. Якщо буде введено некоректне число, то ігнорувати його і перейти до введення наступного числа ( в результаті кількість чисел буде меншою). Вивести знайдену суму.

// let sum = 0
// for (let i = 0; i < 10; i++) {
// 	let num = parseInt(prompt('Number ='))
// 	if (!isFinite(num)) //Якщо значення некоректне - перейти до введення наступного числа
// 	continue
// 	sum += num
// }
// document.write(`Sum = ${sum}`)

// ===================================================================

// Поступово вітаємо 5 користувачів, але Іванів не вітаємо
// for (let i = 0; i < 5; i++) {
// 	const userName = prompt(`Як Вас звати?`)
// 	if (userName === 'Ivan')
// 		continue
// 	alert(`Вітаю ${userName}`)
// }

// ==================================================================

// Комп'ютер поступово генерує 3 випадкові числа (від 1 до 5). Для вгадування кожного числа користувач має 4 спроби. Підрахувати кількість вгаданих чисел.
// --- continue з міткою  mainLoop:, для переривання зовнішнього циклу
// const MIN_NUM =1
// const MAX_NUM = 5
// let guessedNumber =0
// mainLoop: for (let i = 1; i <=3; i++) {
// 	const compNum = Math.floor(MIN_NUM + Math.random()*(MAX_NUM-MIN_NUM+1))
// 	for (let j = 0; j < 4; j++) {
// 		let userNum = parseInt(prompt(`Вгадування ${i}-го числа. Ваша версія:`))
// 		if (userNum === compNum) {
// 			alert('Вгадали')
// 			guessedNumber++
// 			continue mainLoop
// 		} else alert('Не вгадали')
// 	}
// }
// document.write(`Вгадано чисел: ${guessedNumber}`);

// ==================================================================

// Поступово вітаємо учнів з 3-класів (по 20 учнів у класі) поки не зустрінемо Івана. Якщо зустріли Івана, то переходимо до наступного класу.
// В цьому випадку break і continue з міткою одне і те саме
/*
if (confirm("Почати тестування?")) {
   classNumLoop: for (let classNum = 1; classNum <= 3; classNum++) {
   for (let i = 0; i < 20; i++) {
      const userName = prompt(`Номер класу ${classNum}. Як Вас звати?`);
      if (userName === "Ivan") continue classNumLoop;
      alert(`Вітаю ${userName}`);
   }
   }
}
*/
// ====================================================================

