// cуворий режим
"use strict"

// ==========================================================

// Дано кількість секунд, що пройшла від початку доби. Визначити скільки це годин і хвилин.

// Крок 0. Позначення
// секунди - seconds
// хвилини - minutes
// години - hours

// Крок 1. Вводимо необхідні дані
const seconds = parseInt(prompt("Скільки пройшло секунд від початку доби?", "0"));

// Крок 2. Обчислення результату
const hours = Math.floor(seconds / 3600);
const minutes = Math.floor((seconds % 3600) / 60);

// Крок 3. Виведення результатів
document.write(
  `<div class="task__subtitle task__subtitle--green">Cекунди: ${seconds} <br> Години: ${hours} <br> Хвилини: ${minutes}</div>`
);

// =================================================================