// cуворий режим
"use strict"

// ==========================================================

// З клавіатури вводиться назва категорії водія (А-мотоцикл, В-легковий автомобіль, С-вантажний автомобіль). Вивести на
// екран назву транспортного засобу, яким він може керувати.

// Крок 0. Позначення
// категорія водійського посвідчення - drivingLicenseCategory 

// Крок 1. Вводимо необхідні дані
const driverCategory = prompt('Введіть категорію водійського посвідчення','A').toUpperCase()
let result
// Крок 2. Обчислення результату
switch (driverCategory) {
  case "A":
    result = 'мотоцикл';
    break;
  case "B":
    result = 'легковий автомобіль';
    break;
  case "C":
    result = 'вантажний автомобіль';
    break;
  default: result = "Невірно введено категорію водійського посвідчення!";
    break;
}

// Крок 3. Виведення результатів
document.write(`<h2 class="task__subtitle">${result}</h2>`);

// =================================================================