// cуворий режим
"use strict"

// ==========================================================

// З клавіатури вводиться ціна товару і кількість грошей. Якщо грошей не вистачає то відмовляємо у покупці, інакше, якщо ще
// залишаються гроші, то пропонуємо купити лотерею за 4 грн.

// Крок 0. Позначення
// ціна товару - productPrice
// кількість грошей - moneyValue

// Крок 1. Вводимо необхідні дані
const lottery = 4
const productPrice = parseFloat(prompt("Введіть ціну товару", "300"));
const moneyValue = parseFloat(prompt("Введіть кількість грошей", "1000"));


// Крок 2. Обчислення результату
if (moneyValue > productPrice) {
  document.write(
    `<h2 class="task__subtitle task__subtitle--green">Чи можу я Вам запропонувати лотерею за ${lottery} грн?</h2>`
  );
} else
document.write(
  '<h2 class="task__subtitle">Нажаль у Вас недостатньо грошей для покупки</h2>'
);

// Крок 3. Виведення результатів

